Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <comment>(Общ)</comment>
  <hierarchical>true</hierarchical>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>ВалютаВзаиморасчетов</name>
    <comment>(Общ) Определяет валюту взаиморасчетов по договору, не может меняться, если по договору проведен хотя бы один документ</comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВедениеВзаиморасчетов</name>
    <comment>(Общ)</comment>
    <type>
      <types>EnumRef.ВедениеВзаиморасчетовПоДоговорам</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидУсловийДоговора</name>
    <comment>(Упр) </comment>
    <type>
      <types>EnumRef.ВидыУсловийДоговоровВзаиморасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДержатьРезервБезОплатыОграниченноеВремя</name>
    <comment>(Упр) Держать резерв без оплаты ограниченное/неограниченное время</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопустимаяСуммаЗадолженности</name>
    <comment>(Упр) </comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДопустимоеЧислоДнейЗадолженности</name>
    <comment>(Упр) </comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <comment>(Общ) </comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьСуммуЗадолженности</name>
    <comment>(Упр) </comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьЧислоДнейЗадолженности</name>
    <comment>(Упр) </comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбособленныйУчетТоваровПоЗаказамПокупателей</name>
    <comment>(Общ) Обособленный партионный учет Товаров по заказам покупателей</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентКомиссионногоВознаграждения</name>
    <comment>(Общ) </comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособРасчетаКомиссионногоВознаграждения</name>
    <comment>(Общ) </comment>
    <type>
      <types>EnumRef.СпособыРасчетаКомиссионногоВознаграждения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроцентПредоплаты</name>
    <comment>(Упр) </comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипЦен</name>
    <comment>(Общ) Тип цен по умолчанию для оформления покупок по данному договору</comment>
    <type>
      <types>CatalogRef.ТипыЦенНоменклатурыКонтрагентов</types>
      <types>CatalogRef.ТипыЦенНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <comment>(Общ)</comment>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧислоДнейРезерваБезОплаты</name>
    <comment>(Упр) Если 0, то неограничено</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УчетАгентскогоНДС</name>
    <comment>Признак того что в данном договоре организация выступает в качестве налогового агента</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАгентскогоДоговора</name>
    <comment>Разновидность договора с обязанностью оплаты организацией НДС в качестве налогового агента </comment>
    <type>
      <types>EnumRef.ВидыАгентскихДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчетыВУсловныхЕдиницах</name>
    <comment>(Регл)</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьДенежныеСредстваКомитента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РеализацияНаЭкспорт</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидВзаиморасчетов</name>
    <comment>(Упр)</comment>
    <type>
      <types>CatalogRef.ВидыВзаиморасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВестиПоДокументамРасчетовСКонтрагентом</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойПроект</name>
    <type>
      <types>CatalogRef.Проекты</types>
      <types>CatalogRef.ВидыРаспределенияПоПроектам</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнаяСтатьяДвиженияДенежныхСредств</name>
    <type>
      <types>CatalogRef.СтатьиДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеДляСчетаФактурыНаАванс</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокРегистрацииСчетовФактурНаАвансПоДоговору</name>
    <type>
      <types>EnumRef.ПорядокРегистрацииСчетовФактурНаАванс</types>
    </type>
  </attributes>
  <attributes>
    <name>НалоговыйАгентПоОплате</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УстановленСрокОплатыДляРезервовПоСомнительнымДолгам</name>
    <comment>Если не установлен, для контроля просроченной задолженности используется срок из учетной политики организации</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокОплатыДляРезервовПоСомнительнымДолгам</name>
    <comment>Срок в днях, после которого долг считается просроченным</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_ПериодичностьНачисленияПремииКонтрагента</name>
    <type>
      <types>EnumRef.абс_ПериодичностьНачисленияПремийКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ВидОплатыУслугКонтрагента</name>
    <type>
      <types>EnumRef.абс_ВидыОплатУслугКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ОплатаПремииФиксированнойСуммой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_СуммаПремииКонтрагента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_ПроцентПремииКонтрагента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_ОрганизацияПоставщика</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ПодписантПоставщика</name>
    <type>
      <types>CatalogRef.абс_ПодписиОтветственныхЛиц</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ОрганизацияПокупателя</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ПодписантПокупателя</name>
    <type>
      <types>CatalogRef.абс_ПодписиОтветственныхЛиц</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ПредметПоставки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_АдресСклада</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ДатаПоставки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_УсловияДоставки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_СрокОтгрузки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_БанковскийСчетОплатыКонтрагента</name>
    <type>
      <types>CatalogRef.БанковскиеСчета</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_МинимальнаяСуммаЗаказаДляДоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_МинимальнаяСуммаЗаказа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_ОграничениеКонтроляПросроченнойЗадолженности</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ДопустимаяСуммаПросроченнойЗадолженности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>абс_ДопустимоеЧислоДнейЗадолженностиУслугиРетро</name>
    <comment>(Упр) </comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ЧислоДнейПредоплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_КонтрольнаяДатаЗакрытия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лео_СтатусДоговора</name>
    <type>
      <types>EnumRef.Лео_СтатусыДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ИГК</name>
    <type>
      <types>CatalogRef.ГосударственныеКонтракты</types>
    </type>
  </attributes>
  <attributes>
    <name>Лео_ПроцентПредоплатыПоставщик</name>
    <comment>(Упр) </comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>абс_УслугиРетро</name>
    <attributes>
      <name>абс_ПериодДействия</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>абс_ПериодичностьНачисления</name>
      <type>
        <types>EnumRef.абс_ПериодичностьНачисленияПремийКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>абс_БазаНачисления</name>
      <type>
        <types>EnumRef.абс_БазаНачисленияУслугКонтрагента</types>
      </type>
    </attributes>
    <attributes>
      <name>абс_ВидОплаты</name>
      <type>
        <types>EnumRef.абс_ВидыОплатУслугКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>абс_ОплатаФиксированнойСуммой</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>абс_Процент</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>9</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>абс_Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>абс_СтатьяОборотовПоБюджетам</name>
      <type>
        <types>CatalogRef.СтатьиОборотовПоБюджетам</types>
      </type>
    </attributes>
    <attributes>
      <name>абс_АналитикаСтатьиПоБюджету</name>
      <type>
        <types>CatalogRef.абс_АналитикиБюджета</types>
      </type>
    </attributes>
    <attributes>
      <name>абс_ЦФО</name>
      <type>
        <types>CatalogRef.Подразделения</types>
      </type>
    </attributes>
    <attributes>
      <name>абс_ДоговорУслугРетро</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>Лео_ДопСоглашение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Лео_Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Лео_ПороговаяСумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Лео_ДатаОкончанияПериода</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

InformationRegisters/Лео_ИсторияРеквизитаЧислоДнейЗадолженности/Лео_ИсторияРеквизитаЧислоДнейЗадолженности.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>Лео_ИсторияРеквизитаЧислоДнейЗадолженности</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Предоплата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ЧислоДнейПредоплаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДопустимоеЧислоДнейЗадолженности</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Catalogs/ДоговорыКонтрагентов/ObjectModule.bsl
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТИРУЕМЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Функция проверяет, существуют ли ссылки на договор в движениях регистров накопления.
// Если есть - нельзя менять:
//  - Валюту взаиморасчетов
//  - Ведение взаиморасчетов.
//
// Параметры:
//  Нет.
//
// Возвращаемое значение:
//  Истина - если есть движения, Ложь - если нет.
//
Функция СуществуютСсылки() Экспорт

	Возврат ПолныеПрава.ПроверитьНаличиеСсылокНаДоговорКонтрагента(Ссылка);

КонецФункции //  СуществуютСсылки()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Процедура вызывается перед записью элемента справочника.
//
Процедура ПередЗаписью(Отказ)

	// Проверим можно ли изменять реквизиты договора.
	// Проверка осуществляется только если записывается уже существующий договор
	Если НЕ ОбменДанными.Загрузка И НЕ ЭтоНовый() Тогда

		Если ЭтоГруппа Тогда

			// Для группы владельца менять нельзя
			Если Владелец <> Ссылка.Владелец Тогда

				Сообщить("Нельзя изменять контрагента для группы договоров.", СтатусСообщения.Важное);
				Отказ = Истина;

			КонецЕсли; 

		Иначе

			// Проверим возможность смены владельца для договора
			Если Владелец <> Ссылка.Владелец Тогда

				Запрос = Новый Запрос;
				Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
				|	ДокументыПоДоговоруКонтрагента.Ссылка
				|ИЗ
				|	КритерийОтбора.ДокументыПоДоговоруКонтрагента(&Договор) КАК ДокументыПоДоговоруКонтрагента";
				
				Запрос.УстановитьПараметр("Договор", Ссылка);
				
				Результат = Запрос.Выполнить();
				ЕстьДокументыПоДоговору = НЕ Результат.Пустой();
				
				Если ЕстьДокументыПоДоговору Тогда
					Сообщить("Существуют документы, оформленные по договору """ + Наименование + """.
							 |Контрагент договора не может быть изменен, элемент не записан.", 
							 СтатусСообщения.Важное);
					Отказ = Истина;
				КонецЕсли; 

			КонецЕсли; 

			// Проверим возможность смены способа ведения взаиморасчетов и валюты взаиморасчетов
			Если ВедениеВзаиморасчетов <> Ссылка.ВедениеВзаиморасчетов
			 ИЛИ ВалютаВзаиморасчетов <> Ссылка.ВалютаВзаиморасчетов 
			 ИЛИ ВидДоговора <> Ссылка.ВидДоговора
			 ИЛИ Организация <> Ссылка.Организация
			 ИЛИ РасчетыВУсловныхЕдиницах <> Ссылка.РасчетыВУсловныхЕдиницах
			 //ИЛИ ВидУсловийДоговора <> Ссылка.ВидУсловийДоговора 
			 ИЛИ ВестиПоДокументамРасчетовСКонтрагентом <> Ссылка.ВестиПоДокументамРасчетовСКонтрагентом Тогда

				Если ЭтотОбъект.СуществуютСсылки() Тогда

					Сообщить("Существуют документы, проведенные по договору """ + Наименование + """.
							 |Реквизиты ""Организация"", ""Ведение взаиморасчетов"", ""Валюта взаиморасчетов"", ""Вид договора"", 
							 |""По документам расчетов с контрагентом"", ""Расчеты в условных единицах"" и ""Условия выполнения договора"" не могут быть изменены, элемент не записан.", 
							 СтатусСообщения.Важное);
					Отказ = Истина;

				КонецЕсли;

			КонецЕсли;
			Если  ОбособленныйУчетТоваровПоЗаказамПокупателей<>Ссылка.ОбособленныйУчетТоваровПоЗаказамПокупателей Тогда
				Если ПолныеПрава.ПроверитьНаличиеСсылокНаДоговорКонтрагентаВЗаказахПокупателей(Ссылка) Тогда
					Сообщить("Существуют заказы покупателей, проведенные по договору """ + Наименование + """.
					|Реквизит ""Обособленный учет товаров по заказам покупателей"" не может быть изменен, элемент не записан.", 
					СтатусСообщения.Важное);
					Отказ = Истина;

				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;

	КонецЕсли;

	// Проверим заполнение и очистим неиспользуемые реквизиты элемента договора.
	Если Не ЭтоГруппа Тогда

		// Проверим, заполнена ли валюта.
		Если НЕ ОбменДанными.Загрузка И НЕ ЗначениеЗаполнено(ВалютаВзаиморасчетов) Тогда
			Сообщить("Не указана валюта договора.", СтатусСообщения.Важное);
			Отказ = Истина;
		КонецЕсли;

		// Проверим, заполнена ли организация.
		Если НЕ ОбменДанными.Загрузка И НЕ ЗначениеЗаполнено(Организация) Тогда
			Сообщить("Не указана организация, от которой заключен договор.", СтатусСообщения.Важное);
			Отказ = Истина;
		КонецЕсли;

		// Проверим, заполнен ли способ ведения взаиморасчетов.
		Если НЕ ОбменДанными.Загрузка И НЕ ЗначениеЗаполнено(ВедениеВзаиморасчетов) Тогда
			Сообщить("Не указан способ ведения взаиморасчетов по договору.", СтатусСообщения.Важное);
			Отказ = Истина;
		КонецЕсли;

		// Проверим, заполнен ли вид договора.
		Если НЕ ОбменДанными.Загрузка Тогда
		
			Если НЕ ЗначениеЗаполнено(ВидДоговора) Тогда
				Сообщить("Не указан вид договора.", СтатусСообщения.Важное);
				Отказ = Истина;
			Иначе
				// Проверим, правильно ли заполнен вид договора
				Если (ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем ИЛИ ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомиссионером)
					И НЕ Владелец.Покупатель Тогда
					Сообщить("Вид договора ""С покупателем"" может устанавливаться только когда у контрагента указано что он является покупателем.", СтатусСообщения.Важное);
					Отказ = Истина;
				ИначеЕсли (ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком ИЛИ ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СКомитентом)
					И НЕ Владелец.Поставщик Тогда
					Сообщить("Вид договора ""С поставщиком"" может устанавливаться только когда у контрагента указано что он является поставщиком.", СтатусСообщения.Важное);
					Отказ = Истина;
				ИначеЕсли ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.Прочее
					И ВестиПоДокументамРасчетовСКонтрагентом Тогда
					Сообщить("Флажок ""По документам расчетов с контрагентами"" не может устанавливаться у договоров с видом ""Прочее"".", СтатусСообщения.Важное);
					Отказ = Истина;
				КонецЕсли; 
			КонецЕсли;
		
		КонецЕсли; 

	КонецЕсли;

КонецПроцедуры // ПередЗаписью()

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	Перем Контрагент;
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	Контрагент = Владелец;
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("Владелец") Тогда
		Контрагент = ДанныеЗаполнения.Владелец;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВидДоговора) Тогда
		Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
			ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.Прочее;
		Иначе
			Если Контрагент.Покупатель Тогда
				ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем;
			ИначеЕсли Контрагент.Поставщик Тогда
				ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком;
			Иначе
				ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.Прочее;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

	Если ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.Прочее Тогда
		ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом;
	Иначе
		Если НЕ ЗначениеЗаполнено(ВедениеВзаиморасчетов) Тогда
			ВедениеВзаиморасчетов = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновноеВедениеВзаиморасчетовПоДоговорам");
			Если НЕ ЗначениеЗаполнено(ВедениеВзаиморасчетов) Тогда
				ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если Контрагент.НеЯвляетсяРезидентом И ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем Тогда
		РеализацияНаЭкспорт = Истина;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ВалютаВзаиморасчетов) Тогда
		ВалютаВзаиморасчетов = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяВалютаВзаиморасчетов");
		Если НЕ ЗначениеЗаполнено(ВалютаВзаиморасчетов) Тогда
			ВалютаВзаиморасчетов = Константы.ВалютаУправленческогоУчета.Получить();
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Если НЕ (ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("Организация")) Тогда
			Организация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
		КонецЕсли;
	КонецЕсли;

	Если НЕ ЗначениеЗаполнено(ВидУсловийДоговора) Тогда
		ВидУсловийДоговора = Перечисления.ВидыУсловийДоговоровВзаиморасчетов.БезДополнительныхУсловий;
	КонецЕсли;

	Если ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.Прочее Тогда
		ВестиПоДокументамРасчетовСКонтрагентом = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновныеРасчетыПоДокументамСКонтрагентами");
	КонецЕсли;

	Если (ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком
	 ИЛИ  ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем)
	   И ВалютаВзаиморасчетов <> Константы.ВалютаРегламентированногоУчета.Получить() Тогда
		РасчетыВУсловныхЕдиницах = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновныеРасчетыПоДоговоруВУсловныхЕдиницах");
	КонецЕсли;

	Если ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем Тогда
		ПроцентПредоплаты = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнойРазмерПредоплатыПоЗаказуПокупателя");
	КонецЕсли;

	Если ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоДоговоруВЦелом
	 ИЛИ ВедениеВзаиморасчетов = Перечисления.ВедениеВзаиморасчетовПоДоговорам.ПоЗаказам Тогда
		ОбособленныйУчетТоваровПоЗаказамПокупателей = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнойОбособленныйУчетТоваровПоЗаказамПокупателей");
	КонецЕсли;
КонецПроцедуры

//АБС ВСТАВКА Услуги/Ретро  28.07.2014 22:37:28  Тест
Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	НаборДействияУслугРетро = РегистрыСведений.абс_ДействияУслугРетроПоДоговорам.СоздатьНаборЗаписей();
	
	НаборДействияУслугРетро.Отбор.ДоговорКонтрагента.Установить(Ссылка);
	
	НаборДействияУслугРетро.Прочитать();	
	НаборДействияУслугРетро.Очистить();	
	
	Для Каждого СтрУслугиРетро Из абс_УслугиРетро Цикл
		
		СтрНабораДействияУслугРетро = НаборДействияУслугРетро.Добавить();
		
		ЗаполнитьЗначенияСвойств(СтрНабораДействияУслугРетро, СтрУслугиРетро);
		
		СтрНабораДействияУслугРетро.Период 				= СтрУслугиРетро.абс_ПериодДействия;
		СтрНабораДействияУслугРетро.ДоговорКонтрагента 	= Ссылка;
		
	КонецЦикла;
	
	НаборДействияУслугРетро.Записать();
	
	//+Лео Сафонов 09.09.2016
	ЗаписатьРегистрЛео_ИсторияРеквизитаЧислоДнейЗадолженности()
	//-Лео Сафонов 09.09.2016	
КонецПроцедуры
//АБС ВСТАВКА Услуги/Ретро КОНЕЦ 

//+Лео Сафонов 09.09.2016
Процедура ЗаписатьРегистрЛео_ИсторияРеквизитаЧислоДнейЗадолженности ()
	ОтборПоДоговору = Новый Структура;
	ОтборПоДоговору.Вставить("Договор",Ссылка);
	
	ТекущееЗначение = РегистрыСведений.Лео_ИсторияРеквизитаЧислоДнейЗадолженности.СрезПоследних(ТекущаяДата(),ОтборПоДоговору);	
	
	// Покупатели, Прочее
	Если ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком тогда
		Если ТекущееЗначение.Количество() > 0 Тогда
			Для каждого СтрокаТЧ из ТекущееЗначение Цикл
				Если СтрокаТЧ.ДопустимоеЧислоДнейЗадолженности <> Ссылка.ДопустимоеЧислоДнейЗадолженности 
					//Тогда
					//Если (СтрокаТЧ.ДопустимоеЧислоДнейЗадолженности <> Ссылка.ДопустимоеЧислоДнейЗадолженности)
						или
						 СтрокаТЧ.ЧислоДнейПредоплаты <> Ссылка.Лео_ЧислоДнейПредоплаты 
						или
						 СтрокаТЧ.Предоплата <> Ссылка.ПроцентПредоплаты 
						 
						 тогда
					
					НаборИсторияРеквизита = РегистрыСведений.Лео_ИсторияРеквизитаЧислоДнейЗадолженности.СоздатьМенеджерЗаписи();
					НаборИсторияРеквизита.Договор = Ссылка;
					НаборИсторияРеквизита.Период = ТекущаяДата();
					НаборИсторияРеквизита.Прочитать();
					
					НаборИсторияРеквизита.Договор = Ссылка;
					НаборИсторияРеквизита.Период = ТекущаяДата();
					НаборИсторияРеквизита.ДопустимоеЧислоДнейЗадолженности = Ссылка.ДопустимоеЧислоДнейЗадолженности;
					НаборИсторияРеквизита.ЧислоДнейПредоплаты = Ссылка.Лео_ЧислоДнейПредоплаты;
	        		НаборИсторияРеквизита.Предоплата          = Ссылка.ПроцентПредоплаты;
					НаборИсторияРеквизита.Ответственный = ПараметрыСеанса.ТекущийПользователь;
					НаборИсторияРеквизита.Записать();
				КонецЕсли;
			КонецЦикла;		
		Иначе
			НаборИсторияРеквизита = РегистрыСведений.Лео_ИсторияРеквизитаЧислоДнейЗадолженности.СоздатьМенеджерЗаписи();
			НаборИсторияРеквизита.Договор = Ссылка;
			НаборИсторияРеквизита.Период = ТекущаяДата();
			НаборИсторияРеквизита.ДопустимоеЧислоДнейЗадолженности = Ссылка.ДопустимоеЧислоДнейЗадолженности;
			НаборИсторияРеквизита.ЧислоДнейПредоплаты = Ссылка.Лео_ЧислоДнейПредоплаты;
			НаборИсторияРеквизита.Предоплата          = Ссылка.ПроцентПредоплаты;
			НаборИсторияРеквизита.Ответственный = ПараметрыСеанса.ТекущийПользователь;
			НаборИсторияРеквизита.Записать();
		КонецЕсли;
	КонецЕсли;
	
	// Поставщики
	Если ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком тогда
		Если ТекущееЗначение.Количество() > 0 Тогда
			Для каждого СтрокаТЧ из ТекущееЗначение Цикл
				Если СтрокаТЧ.ДопустимоеЧислоДнейЗадолженности <> Ссылка.ДопустимоеЧислоДнейЗадолженности 
					или СтрокаТЧ.Предоплата <> Лео_ПроцентПредоплатыПоставщик тогда
					
					НаборИсторияРеквизита = РегистрыСведений.Лео_ИсторияРеквизитаЧислоДнейЗадолженности.СоздатьМенеджерЗаписи();
					НаборИсторияРеквизита.Договор = Ссылка;
					НаборИсторияРеквизита.Период = ТекущаяДата();
					НаборИсторияРеквизита.Прочитать();
					
					НаборИсторияРеквизита.Договор = Ссылка;
					НаборИсторияРеквизита.Период = ТекущаяДата();
					НаборИсторияРеквизита.ДопустимоеЧислоДнейЗадолженности = Ссылка.ДопустимоеЧислоДнейЗадолженности;
					НаборИсторияРеквизита.Предоплата = Лео_ПроцентПредоплатыПоставщик;
					НаборИсторияРеквизита.Ответственный = ПараметрыСеанса.ТекущийПользователь;
					НаборИсторияРеквизита.Записать();
				КонецЕсли;
			КонецЦикла;		
		Иначе
			НаборИсторияРеквизита = РегистрыСведений.Лео_ИсторияРеквизитаЧислоДнейЗадолженности.СоздатьМенеджерЗаписи();
			НаборИсторияРеквизита.Договор = Ссылка;
			НаборИсторияРеквизита.Период = ТекущаяДата();
			НаборИсторияРеквизита.ДопустимоеЧислоДнейЗадолженности = Ссылка.ДопустимоеЧислоДнейЗадолженности;
			НаборИсторияРеквизита.Предоплата = Лео_ПроцентПредоплатыПоставщик;
			НаборИсторияРеквизита.Ответственный = ПараметрыСеанса.ТекущийПользователь;
			НаборИсторияРеквизита.Записать();
		КонецЕсли;
	КонецЕсли;

	
	
КонецПроцедуры
//-Лео Сафонов 09.09.2016
